# --------------------------------------------------------------------------------------------------------------- первое

def is_prime(x):
    k = 0
    for i in range(2, x // 2 + 1):
        if x % i == 0:
            k += 1
    if k <= 0:
        return True
    return False


#
#
# n = 0
# while True:
#     s = '>' + '0' * 39 + '1' * n + 39 * '2'
#     c = str(s)
#     while ('>1' in c) or ('>2' in c) or ('>0' in c):
#         if '>1' in c:
#             c = c.replace('>1', '22>', 1)
#         if '>2' in c:
#             c = c.replace('>2', '2>', 1)
#         if '>0' in c:
#             c = c.replace('>0', '1>', 1)
#     if is_prime(sum([int(x) for x in c.replace('>', '')])):
#         break
#     else:
#         n += 1
#
# print(n)

# --------------------------------------------------------------------------------------------------------------- второе
# for n in range(1, 16):
#     s = '1' * (100 + n)
#     while '111' in s:
#         s = s.replace('111', '22', 1)
#         s = s.replace('222', '11', 1)
#     print(s.count('1'), n + 100)

# --------------------------------------------------------------------------------------------------------------- третье

for i in range(100, 200):
    r = i * 1 + i * 2 - 1
    if is_prime(r):
        print(i)
        break
    # ПОЧЕМУ ЭТО РАБОТАЕТ ???

# ----------------------------------------------------------------------------------------------------------------- 9365

s = '8' * 68
while '888' in s or '222' in s:
    if '222' in s:
        s = s.replace('222', '8', 1)
    else:
        s = s.replace('888', '2', 1)
print(s)

